wisefin/entryservice/service/oracle_request_xml/journal_input_file.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:typ="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/types/"
                  xmlns:jour="http://xmlns.oracle.com/apps/financials/generalLedger/journals/desktopEntry/journalImportService/"
                  xmlns:jour1="http://xmlns.oracle.com/apps/flex/financials/generalLedger/journals/desktopEntry/journalLineGdf/">
    <soapenv:Header/>
    <soapenv:Body>
        <typ:importJournals>
            <typ:interfaceRows>
                <jour:BatchName/>
                <jour:BatchDescription/>
                <jour:LedgerId/>
                <jour:AccountingPeriodName/>
                <jour:AccountingDate/>
                <jour:UserSourceName/>
                <jour:UserCategoryName/>
                <jour:ErrorToSuspenseFlag/>
                <jour:SummaryFlag/>
                <jour:ImportDescriptiveFlexField/>
                <jour:GlInterface>
                    <jour:Reference4/>
                    <jour:Reference5/>
                    <jour:LedgerId/>
                    <jour:PeriodName/>
                    <jour:AccountingDate/>
                    <jour:UserJeSourceName/>
                    <jour:UserJeCategoryName/>
                    <jour:GroupId/>
                    <jour:ChartOfAccountsId/>
                    <jour:BalanceType/>
                    <jour:CodeCombinationId/>
                    <jour:Segment1/>
                    <jour:Segment2/>
                    <jour:Segment3/>
                    <jour:Segment4/>
                    <jour:Segment5/>
                    <jour:Segment6/>
                    <jour:Segment7/>
                    <jour:Segment8/>
                    <jour:Segment9/>
                    <jour:Segment10/>
                    <jour:Segment11/>
                    <jour:Segment12/>
                    <jour:Segment13/>
                    <jour:Segment14/>
                    <jour:Segment15/>
                    <jour:Segment16/>
                    <jour:Segment17/>
                    <jour:Segment18/>
                    <jour:Segment19/>
                    <jour:Segment20/>
                    <jour:Segment21/>
                    <jour:Segment22/>
                    <jour:Segment23/>
                    <jour:Segment24/>
                    <jour:Segment25/>
                    <jour:Segment26/>
                    <jour:Segment27/>
                    <jour:Segment28/>
                    <jour:Segment29/>
                    <jour:Segment30/>
                    <jour:CurrencyCode/>
                    <jour:EnteredCrAmount currencyCode="INR"/>
                    <jour:EnteredDrAmount currencyCode="INR"/>
                    <jour:AccountedCr/>
                    <jour:AccountedDr/>
                    <jour:StatisticalValue/>
                    <jour:UserCurrencyConversionType/>
                    <jour:CurrencyConversionDate/>
                    <jour:CurrencyConversionRate/>
                    <jour:CurrencyConversionType/>
                    <jour:Reference1/>
                    <jour:Reference2/>
                    <jour:Reference3/>
                    <jour:Reference6/>
                    <jour:Reference7/>
                    <jour:Reference8/>
                    <jour:Reference9/>
                    <jour:Reference10/>
                    <jour:Reference11/>
                    <jour:Reference12/>
                    <jour:Reference13/>
                    <jour:Reference14/>
                    <jour:Reference15/>
                    <jour:Reference16/>
                    <jour:Reference17/>
                    <jour:Reference18/>
                    <jour:Reference19/>
                    <jour:Reference20/>
                    <jour:Reference21/>
                    <jour:Reference22/>
                    <jour:Reference23/>
                    <jour:Reference24/>
                    <jour:Reference25/>
                    <jour:Reference26/>
                    <jour:Reference27/>
                    <jour:Reference28/>
                    <jour:Reference29/>
                    <jour:Reference30/>
                    <jour:ReferenceDate/>
                    <jour:Attribute1/>
                    <jour:Attribute2/>
                    <jour:Attribute3/>
                    <jour:Attribute4/>
                    <jour:Attribute5/>
                    <jour:Attribute6/>
                    <jour:Attribute7/>
                    <jour:Attribute8/>
                    <jour:Attribute9/>
                    <jour:Attribute10/>
                    <jour:Attribute11/>
                    <jour:Attribute12/>
                    <jour:Attribute13/>
                    <jour:Attribute14/>
                    <jour:Attribute15/>
                    <jour:Attribute16/>
                    <jour:Attribute17/>
                    <jour:Attribute18/>
                    <jour:Attribute19/>
                    <jour:Attribute20/>
                    <jour:AttributeCategory/>
                    <jour:AttributeCategory2/>
                    <jour:AttributeCategory3/>
                    <jour:AverageJournalFlag/>
                    <jour:BalancingSegmentValue/>
                    <jour:DescrFlexErrorMessage/>
                    <jour:GlSlLinkId/>
                    <jour:GlSlLinkTable/>
                    <jour:InvoiceDate/>
                    <jour:InvoiceIdentifier/>
                    <jour:JeCategoryName/>
                    <jour:JeSourceName/>
                    <jour:JgzzReconReference/>
                    <jour:ManagementSegmentValue/>
                    <jour:ObjectVersionNumber/>
                    <jour:OriginatingBalSegValue/>
                    <jour:SetOfBooksId/>
                    <jour:Status/>
                    <jour:TaxCode/>
                    <jour:TransactionDate/>
                    <jour:USSGLTransactionCode/>
                    <jour:GlInterfaceId/>
                    <jour:LegalEntityIdentifier/>
                    <jour:LedgerName/>
                    <jour:AttributeDate1/>
                    <jour:AttributeDate10/>
                    <jour:AttributeDate2/>
                    <jour:AttributeDate3/>
                    <jour:AttributeDate4/>
                    <jour:AttributeDate5/>
                    <jour:AttributeDate6/>
                    <jour:AttributeDate7/>
                    <jour:AttributeDate8/>
                    <jour:AttributeDate9/>
                    <jour:AttributeNumber1/>
                    <jour:AttributeNumber10/>
                    <jour:AttributeNumber2/>
                    <jour:AttributeNumber3/>
                    <jour:AttributeNumber4/>
                    <jour:AttributeNumber5/>
                    <jour:AttributeNumber6/>
                    <jour:AttributeNumber7/>
                    <jour:AttributeNumber8/>
                    <jour:AttributeNumber9/>
                    <jour:JournalLineGdf>
                        <jour1:GlInterfaceId/>
                        <jour1:FLEX_PARAM_GLOBAL_COUNTRY_CODE/>
                        <jour1:__FLEX_Context/>
                        <jour1:__FLEX_Context_DisplayValue/>
                        <jour1:_FLEX_NumOfSegments/>
                    </jour:JournalLineGdf>
                </jour:GlInterface>
            </typ:interfaceRows>
        </typ:importJournals>
    </soapenv:Body>
</soapenv:Envelope>